### Group_By: multivariate analysis

In [1]:
import pandas as pd

New dataset drink.csv

In [2]:
df=pd.read_csv("D:\studymaterial\DATA SCIENCE\drinks.csv")

<>:1: SyntaxWarning: "\s" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\s"? A raw string is also an option.
<>:1: SyntaxWarning: "\s" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\s"? A raw string is also an option.
C:\Users\Pcz\AppData\Local\Temp\ipykernel_2304\3963996324.py:1: SyntaxWarning: "\s" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\s"? A raw string is also an option.
  df=pd.read_csv("D:\studymaterial\DATA SCIENCE\drinks.csv")

In [3]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

#### group by on categorical & discrete data,not on continuous dt

In [4]:
x=df.groupby("continent")
x.first()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,,
AF,Algeria,25,0,14,0.7
AS,Afghanistan,0,0,0,0.0
EU,Albania,89,132,54,4.9
OC,Australia,261,72,212,10.4
SA,Argentina,193,25,221,8.3

each first entry of every continent

In [5]:
x.get_group("AF")

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
2,Algeria,25,0,14,0.7,AF
4,Angola,217,57,45,5.9,AF
18,Benin,34,4,13,1.1,AF
22,Botswana,173,35,35,5.4,AF
26,Burkina Faso,25,7,7,4.3,AF
27,Burundi,88,0,0,6.3,AF
28,Cote d'Ivoire,37,1,7,4.0,AF
29,Cabo Verde,144,56,16,4.0,AF
31,Cameroon,147,1,4,5.8,AF
33,Central African Republic,17,2,1,1.8,AF
34,Chad,15,1,1,0.4,AF
38,Comoros,1,3,1,0.1,AF
39,Congo,76,1,9,1.7,AF
47,DR Congo,32,3,1,2.3,AF
49,Djibouti,15,44,3,1.1,AF
53,Egypt,6,4,1,0.2,AF
55,Equatorial Guinea,92,0,233,5.8,AF
56,Eritrea,18,0,0,0.5,AF
58,Ethiopia,20,3,0,0.7,AF
62,Gabon,347,98,59,8.9,AF
63,Gambia,8,0,1,2.4,AF
66,Ghana,31,3,10,1.8,AF
70,Guinea,9,0,2,0.2,AF
71,Guinea-Bissau,28,31,21,2.5,AF
88,Kenya,58,22,2,1.8,AF
95,Lesotho,82,29,0,2.8,AF
96,Liberia,19,152,2,3.1,AF
97,Libya,0,0,0,0.0,AF
100,Madagascar,26,15,4,0.8,AF
101,Malawi,8,11,1,1.5,AF
104,Mali,5,1,1,0.6,AF
107,Mauritania,0,0,0,0.0,AF
108,Mauritius,98,31,18,2.6,AF
114,Morocco,12,6,10,0.5,AF
115,Mozambique,47,18,5,1.3,AF
117,Namibia,376,3,1,6.8,AF
123,Niger,3,2,1,0.1,AF
124,Nigeria,42,5,2,9.1,AF
142,Rwanda,43,2,0,6.8,AF
148,Sao Tome & Principe,56,38,140,4.2,AF
150,Senegal,9,1,7,0.3,AF
152,Seychelles,157,25,51,4.1,AF
153,Sierra Leone,25,3,2,6.7,AF
158,Somalia,0,0,0,0.0,AF
159,South Africa,225,76,81,8.2,AF
162,Sudan,8,13,0,1.7,AF
164,Swaziland,90,2,2,4.7,AF
172,Togo,36,2,19,1.3,AF
175,Tunisia,51,3,20,1.3,AF
179,Uganda,45,9,0,8.3,AF
183,Tanzania,36,6,1,5.7,AF
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [6]:
#group by on two columns/features:
var= df.groupby( ["continent","country"])
var.first()

                        beer_servings  spirit_servings  wine_servings  \
continent country
AF        Algeria                  25                0             14
          Angola                  217               57             45
          Benin                    34                4             13
          Botswana                173               35             35
          Burkina Faso             25                7              7
...                               ...              ...            ...
SA        Paraguay                213              117             74
          Peru                    163              160             21
          Suriname                128              178              7
          Uruguay                 115               35            220
          Venezuela               333              100              3

                        total_litres_of_pure_alcohol
continent country
AF        Algeria                                0.7
          Angola                                 5.9
          Benin                                  1.1
          Botswana                               5.4
          Burkina Faso                           4.3
...                                              ...
SA        Paraguay                               7.3
          Peru                                   6.1
          Suriname                               5.6
          Uruguay                                6.6
          Venezuela                              7.7

[170 rows x 4 columns]

In [9]:
var.get_group("Peru")

ValueError: must supply a tuple to get_group with multiple grouping keys

## can't find group key for 2 columns as saw above

In [7]:
lon=pd.read_csv("D:\studymaterial\DATA SCIENCE\loan_data_set.csv")
lon

<>:1: SyntaxWarning: "\s" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\s"? A raw string is also an option.
<>:1: SyntaxWarning: "\s" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\s"? A raw string is also an option.
C:\Users\Pcz\AppData\Local\Temp\ipykernel_2304\3160741973.py:1: SyntaxWarning: "\s" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\s"? A raw string is also an option.
  lon=pd.read_csv("D:\studymaterial\DATA SCIENCE\loan_data_set.csv")

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [10]:
ft= lon.groupby(["Gender","Married"])  #4groups
ft

In [12]:
ft.first()

                 Loan_ID Dependents Education Self_Employed  ApplicantIncome  \
Gender Married
Female No       LP001036          0  Graduate            No             3510
       Yes      LP001112          0  Graduate            No             3667
Male   No       LP001002          0  Graduate            No             5849
       Yes      LP001003          1  Graduate            No             4583

                CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
Gender Married
Female No                     0.0        76.0             360.0
       Yes                 1459.0       144.0             360.0
Male   No                     0.0       141.0             360.0
       Yes                 1508.0       128.0             360.0

                Credit_History Property_Area Loan_Status
Gender Married
Female No                  0.0         Urban           N
       Yes                 1.0     Semiurban           Y
Male   No                  1.0         Urban           Y
       Yes                 1.0         Rural           N

### let have find how many drink sold today?
then use Aggregate functions: 5 
#### sum(), avg(), min(),max(),

In [13]:
#what is the total wine serving for the asia continent:
df.groupby("continent").agg( {"wine_servings": "sum"})

           wine_servings
continent
AF                   862
AS                   399
EU                  6400
OC                   570
SA                   749

In [16]:
df.groupby("continent").get_group("AS").agg( {"wine_servings": "sum"})

wine_servings    399
dtype: int64

In [17]:
#sum & avg:
df.groupby("continent").agg( {"wine_servings": ["sum","mean"], "spirit_servings":"min"})

          wine_servings             spirit_servings
                    sum        mean             min
continent
AF                  862   16.264151               0
AS                  399    9.068182               0
EU                 6400  142.222222               0
OC                  570   35.625000               0
SA                  749   62.416667              25

In [14]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [15]:
#every column:
df.groupby("continent").sum()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,,
AF,AlgeriaAngolaBeninBotswanaBurkina FasoBurundiC...,3258,866,862,159.4
AS,AfghanistanBahrainBangladeshBhutanBruneiCambod...,1630,2677,399,95.5
EU,AlbaniaAndorraArmeniaAustriaAzerbaijanBelarusB...,8720,5965,6400,387.8
OC,AustraliaCook IslandsFijiKiribatiMarshall Isla...,1435,935,570,54.1
SA,ArgentinaBoliviaBrazilChileColombiaEcuadorGuya...,2101,1377,749,75.7

#### find the avg loan amount for the female and max applicant income

In [19]:
res= lon.groupby("Gender").agg({ "LoanAmount":"mean", "ApplicantIncome":"max"})
res

        LoanAmount  ApplicantIncome
Gender
Female  126.697248            19484
Male    149.265957            81000

In [22]:
res=res.reset_index()
res

   index  Gender  LoanAmount  ApplicantIncome
0      0  Female  126.697248            19484
1      1    Male  149.265957            81000

In [24]:
res.iloc[0, :]

index                       0
Gender                 Female
LoanAmount         126.697248
ApplicantIncome         19484
Name: 0, dtype: object

In [28]:
res=res.iloc[0:1, :]   
res    #Dataframe ,not series

   index  Gender  LoanAmount  ApplicantIncome
0      0  Female  126.697248            19484

In [ ]:
#final answer
res=res.rename(columns={"LoanAmount"})

In [29]:
lon

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [31]:
lon.sort_values( by="ApplicantIncome")[ :5]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
216,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
468,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
600,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
500,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
188,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

In [32]:
lon.sort_values( by="ApplicantIncome").head(7)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
216,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
468,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
600,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
500,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
188,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y
77,LP001259,Male,Yes,1,Graduate,Yes,1000,3022.0,110.0,360.0,1.0,Urban,N
418,LP002345,Male,Yes,0,Graduate,No,1025,2773.0,112.0,360.0,1.0,Rural,Y

In [36]:
#extract  least 5 values:
lon.sort_values( by="LoanAmount")[ :5]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
568,LP002840,Female,No,0,Graduate,No,2378,0.0,9.0,360.0,1.0,Urban,N
14,LP001030,Male,Yes,2,Graduate,No,1299,1086.0,17.0,120.0,1.0,Urban,Y
133,LP001482,Male,Yes,0,Graduate,Yes,3459,0.0,25.0,120.0,1.0,Semiurban,Y
94,LP001325,Male,No,0,Not Graduate,No,3620,0.0,25.0,120.0,1.0,Semiurban,Y
555,LP002792,Male,Yes,1,Graduate,No,5468,1032.0,26.0,360.0,1.0,Semiurban,Y

In [35]:
# Top 5:  descending
lon.sort_values( by="ApplicantIncome",ascending=False)[ :5]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
409,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N
333,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
171,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
155,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
185,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y